import 'package:get/get_navigation/src/root/internacionalization.dart';

class Languages extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'bn_BD': {
          //VumiSeba Details/////////////////////////////////////////
          'ভূমি সেবাসমূহ': 'ভূমি সেবাসমূহ',
          "সব দেখুন": "সব দেখুন",
          "সেবা প্রদান পদ্ধতি (সংক্ষেপে)": "সেবা প্রদান পদ্ধতি (সংক্ষেপে)",
          "সেবা প্রাপ্তি সময়": "সেবা প্রাপ্তি সময়",
          "প্রয়োজনীয় ফি": "প্রয়োজনীয় ফি",
          "সেবা প্রাপ্তির স্থান": "সেবা প্রাপ্তির স্থান",
          "দায়িত্বপ্রাপ্ত কর্মকর্তা/কর্মচারী":
              "দায়িত্বপ্রাপ্ত কর্মকর্তা/কর্মচারী",
          "প্রয়োজনীয় কাগজপত্র": "প্রয়োজনীয় কাগজপত্র",
          "সেবা প্রাপ্তির শর্তাবলি": "সেবা প্রাপ্তির শর্তাবলি",
          "সংশ্লিষ্ট আইন ও বিধি": "সংশ্লিষ্ট আইন ও বিধি",
          "সেবা প্রদানে ব্যর্থ হলে প্রতিকারকারী কর্মকর্তা":
              "সেবা প্রদানে ব্যর্থ হলে প্রতিকারকারী কর্মকর্তা",
          "পদ্ধতি চিত্র": "পদ্ধতি চিত্র",
          "ক্লিক করুন": "ক্লিক করুন",

          //others application//////////////////////////////
          "অন্যান্য এপ্লিকেশন": "অন্যান্য এপ্লিকেশন",
          "ভূমি উন্নয়ন কর": "ভূমি উন্নয়ন কর",
          "ই-নামজারি": "ই-নামজারি",
          "ই-বুক": "ই-বুক",
          "ই-খতিয়ান": "ই-খতিয়ান",
          "উত্তরাধিকার": "উত্তরাধিকার",

          //////Vumiseba sumuho tanslate//////////////////////////////////////

          //নামজারি সংক্রান্ত ও জমাভাগ বিষয়ক...................
          "নামজারি সংক্রান্ত ও জমাভাগ বিষয়ক":
              "নামজারি সংক্রান্ত ও জমাভাগ বিষয়ক",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণ": "নামজারি ও জমাভাগ/জমা একত্রিকরণ",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণের আদেশের রিভিউ":
              "নামজারি ও জমাভাগ/জমা একত্রিকরণের আদেশের রিভিউ",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণ  কেসের ডুপ্লিকেট খতিয়ান প্রদান":
              "নামজারি ও জমাভাগ/জমা একত্রিকরণ  কেসের ডুপ্লিকেট খতিয়ান প্রদান",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণ/বিবিধ কেসের আদেশের নকল/সার্টিফাইড কপি প্রদান":
              "নামজারি ও জমাভাগ/জমা একত্রিকরণ/বিবিধ কেসের আদেশের নকল/সার্টিফাইড কপি প্রদান",
          "খতিয়ানের করণিক ভুল সংশোধন": "খতিয়ানের করণিক ভুল সংশোধন",
          "দেওয়ানী আদালতের রায়/আদেশ মূলে রেকর্ড সংশোধন":
              "দেওয়ানী আদালতের রায়/আদেশ মূলে রেকর্ড সংশোধন",

          /////////////////////ভূমি উন্নয়ন কর ব্যাবস্থাপনা বিষয়ক.///////////////////////
          "ভূমি উন্নয়ন কর ব্যাবস্থাপনা বিষয়ক":
              "ভূমি উন্নয়ন কর ব্যাবস্থাপনা বিষয়ক",
          "ভূমি উন্নয়ন কর নির্ধারণীর আপত্তি নিষ্পত্তি":
              "ভূমি উন্নয়ন কর নির্ধারণীর আপত্তি নিষ্পত্তি",
          "ভূমির ব্যবহার ভিত্তিক ভূমি উন্নয়ন কর নির্ধারণে দাবির আপত্তি আবেদন নিষ্পত্তি":
              "ভূমির ব্যবহার ভিত্তিক ভূমি উন্নয়ন কর নির্ধারণে দাবির আপত্তি আবেদন নিষ্পত্তি",
          "রিটার্ন বাতিল বা রিটার্ন দাখিলের মাধ্যমে ভূমি উন্নয়ন কর হার নির্ধারণ":
              "রিটার্ন বাতিল বা রিটার্ন দাখিলের মাধ্যমে ভূমি উন্নয়ন কর হার নির্ধারণ",
          "সিকস্তি জনিত ভূমি উন্নয়ন করের হার পুনঃনির্ধারণেরর আবেদন নিষ্পত্তি":
              "সিকস্তি জনিত ভূমি উন্নয়ন করের হার পুনঃনির্ধারণেরর আবেদন নিষ্পত্তি",

          ////////////////খাস জমি বন্দোবস্ত বিষয়ক.///////////////////////////////
          "খাস জমি বন্দোবস্ত বিষয়ক": "খাস জমি বন্দোবস্ত বিষয়ক",
          "ভূমিহীনদের মাঝে কৃষি খাস জমি বন্দোবস্ত প্রদান":
              "ভূমিহীনদের মাঝে কৃষি খাস জমি বন্দোবস্ত প্রদান",
          "বন্দোবস্তকৃত খাস জমির দখল বুঝিয়ে দেয়া":
              "বন্দোবস্তকৃত খাস জমির দখল বুঝিয়ে দেয়া",
          "অকৃষি খাস জমি বন্দোবস্ত প্রদান": "অকৃষি খাস জমি বন্দোবস্ত প্রদান",

          ///////////////////////অর্পিত/পরিত্যক্ত সম্পত্তি ব্যাবস্থাপনা বিষয়ক.//////////
          "অর্পিত/পরিত্যক্ত সম্পত্তি ব্যাবস্থাপনা বিষয়ক":
              "অর্পিত/পরিত্যক্ত সম্পত্তি ব্যাবস্থাপনা বিষয়ক",
          "অর্পিত সম্পত্তির লিজ নবায়ন": "অর্পিত সম্পত্তির লিজ নবায়ন",
          "অর্পিত সম্পত্তির লিজির নাম পরিবর্তনসহ লিজ নবায়ন":
              "অর্পিত সম্পত্তির লিজির নাম পরিবর্তনসহ লিজ নবায়ন",
          "পরিত্যক্ত সম্পত্তি (এপি) ইজারা প্রদান":
              "পরিত্যক্ত সম্পত্তি (এপি) ইজারা প্রদান",
          "পরিত্যক্ত সম্পত্তি (এপি) ইজারা নবায়ন":
              "পরিত্যক্ত সম্পত্তি (এপি) ইজারা নবায়ন",
          "পরিত্যক্ত সম্পত্তির (এপি) ইজারাগ্রহীতার নাম পরিবর্তন":
              "পরিত্যক্ত সম্পত্তির (এপি) ইজারাগ্রহীতার নাম পরিবর্তন",

          /////////////////////////সায়রাত মহাল বিষয়ক.///////////////////
          "সায়রাত মহাল বিষয়ক": "সায়রাত মহাল বিষয়ক",
          "হাটবাজারের চান্দিনাভিটি একসনা বন্দোবস্ত প্রদান":
              "হাটবাজারের চান্দিনাভিটি একসনা বন্দোবস্ত প্রদান",
          "হাটবাজারের চান্দিনাভিটি ব্যবহারের লাইসেন্স নবায়ন":
              "হাটবাজারের চান্দিনাভিটি ব্যবহারের লাইসেন্স নবায়ন",
          "হাটবাজারের চান্দিনাভিটি ভূমি ব্যবহারের লাইসেন্সধারীর নাম পরিবর্তনসহ নবায়ন":
              "হাটবাজারের চান্দিনাভিটি ভূমি ব্যবহারের লাইসেন্সধারীর নাম পরিবর্তনসহ নবায়ন",
          "হাটবাজার ইজারা প্রদান": "হাটবাজার ইজারা প্রদান",
          "জলমহাল ইজারা প্রদান": "জলমহাল ইজারা প্রদান",

          //////////////////////////////ভূমি বিষয়ক অন্যান্য////////////////
          "ভূমি বিষয়ক অন্যান্য": "ভূমি বিষয়ক অন্যান্য",
          "আদিবাসিদের জমি হস্তান্তরের অনুমতি প্রদান":
              "আদিবাসিদের জমি হস্তান্তরের অনুমতি প্রদান",
          "জমির অখণ্ডতার সনদের জন্য আবেদন নিষ্পত্তিকরণ":
              "জমির অখণ্ডতার সনদের জন্য আবেদন নিষ্পত্তিকরণ",
          "করাত কল স্থাপনের জন্য জমির মালিকানার প্রত্যয়নপত্র প্রদান":
              "করাত কল স্থাপনের জন্য জমির মালিকানার প্রত্যয়নপত্র প্রদান",
          "ভূমির শ্রেণি পরিবর্তনের আবেদন নিস্পত্তি":
              "ভূমির শ্রেণি পরিবর্তনের আবেদন নিস্পত্তি",
        },
        'en_US': {
          //VumiSeba Details page title translate/////////////////////////////////////////
          'ভূমি সেবাসমূহ': 'Land Services',
          "সব দেখুন": "View All",
          "সেবা প্রদান পদ্ধতি (সংক্ষেপে)":
              "Service Delivery Procedures (In Brief)",
          "সেবা প্রাপ্তি সময়": "Service Availability Time",
          "প্রয়োজনীয় ফি": "Required Fee",
          "সেবা প্রাপ্তির স্থান": "Place of Receipt of Service",
          "দায়িত্বপ্রাপ্ত কর্মকর্তা/কর্মচারী": "Responsible Officer/Employee",
          "প্রয়োজনীয় কাগজপত্র": "Required Documents",
          "সেবা প্রাপ্তির শর্তাবলি": "Terms of Service",
          "সংশ্লিষ্ট আইন ও বিধি": "Relevant Laws and Regulations",
          "সেবা প্রদানে ব্যর্থ হলে প্রতিকারকারী কর্মকর্তা":
              "Remedial Officer in case of failure to render service",
          "পদ্ধতি চিত্র": "Process Map",
          "ক্লিক করুন": "Click",

          //others application//////////////////////////////
          "অন্যান্য এপ্লিকেশন": "Other Applications",
          "ভূমি উন্নয়ন কর": "Land Development Tax",
          "ই-নামজারি": "E-Namjari",
          "ই-বুক": "E-Book",
          "ই-খতিয়ান": "E-Khatian",
          "উত্তরাধিকার": "Uttorodhikar",

          //////Vumiseba sumuho tanslate//////////////////////////////////////

          //নামজারি সংক্রান্ত ও জমাভাগ বিষয়ক...................
          "নামজারি সংক্রান্ত ও জমাভাগ বিষয়ক":
              "নামজারি সংক্রান্ত ও জমাভাগ বিষয়ক",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণ": "নামজারি ও জমাভাগ/জমা একত্রিকরণ",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণের আদেশের রিভিউ":
              "নামজারি ও জমাভাগ/জমা একত্রিকরণের আদেশের রিভিউ",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণ কেসের ডুপ্লিকেট খতিয়ান প্রদান":
              "নামজারি ও জমাভাগ/জমা একত্রিকরণ কেসের ডুপ্লিকেট খতিয়ান প্রদান",
          "নামজারি ও জমাভাগ/জমা একত্রিকরণ/বিবিধ কেসের আদেশের নকল/সার্টিফাইড কপি প্রদান":
              "নামজারি ও জমাভাগ/জমা একত্রিকরণ/বিবিধ কেসের আদেশের নকল/সার্টিফাইড কপি প্রদান",
          "খতিয়ানের করণিক ভুল সংশোধন": "খতিয়ানের করণিক ভুল সংশোধন",
          "দেওয়ানী আদালতের রায়/আদেশ মূলে রেকর্ড সংশোধন":
              "দেওয়ানী আদালতের রায়/আদেশ মূলে রেকর্ড সংশোধন",

          /////////////////////ভূমি উন্নয়ন কর ব্যাবস্থাপনা বিষয়ক.///////////////////////
          "ভূমি উন্নয়ন কর ব্যাবস্থাপনা বিষয়ক":
              "ভূমি উন্নয়ন কর ব্যাবস্থাপনা বিষয়ক",
          "ভূমি উন্নয়ন কর নির্ধারণীর আপত্তি নিষ্পত্তি":
              "ভূমি উন্নয়ন কর নির্ধারণীর আপত্তি নিষ্পত্তি",
          "ভূমির ব্যবহার ভিত্তিক ভূমি উন্নয়ন কর নির্ধারণে দাবির আপত্তি আবেদন নিষ্পত্তি":
              "ভূমির ব্যবহার ভিত্তিক ভূমি উন্নয়ন কর নির্ধারণে দাবির আপত্তি আবেদন নিষ্পত্তি",
          "রিটার্ন বাতিল বা রিটার্ন দাখিলের মাধ্যমে ভূমি উন্নয়ন কর হার নির্ধারণ":
              "রিটার্ন বাতিল বা রিটার্ন দাখিলের মাধ্যমে ভূমি উন্নয়ন কর হার নির্ধারণ",
          "সিকস্তি জনিত ভূমি উন্নয়ন করের হার পুনঃনির্ধারণেরর আবেদন নিষ্পত্তি":
              "সিকস্তি জনিত ভূমি উন্নয়ন করের হার পুনঃনির্ধারণেরর আবেদন নিষ্পত্তি",

          ////////////////খাস জমি বন্দোবস্ত বিষয়ক.///////////////////////////////
          "খাস জমি বন্দোবস্ত বিষয়ক": "খাস জমি বন্দোবস্ত বিষয়ক",
          "ভূমিহীনদের মাঝে কৃষি খাস জমি বন্দোবস্ত প্রদান":
              "ভূমিহীনদের মাঝে কৃষি খাস জমি বন্দোবস্ত প্রদান",
          "বন্দোবস্তকৃত খাস জমির দখল বুঝিয়ে দেয়া":
              "বন্দোবস্তকৃত খাস জমির দখল বুঝিয়ে দেয়া",
          "অকৃষি খাস জমি বন্দোবস্ত প্রদান": "অকৃষি খাস জমি বন্দোবস্ত প্রদান",

          ///////////////////////অর্পিত/পরিত্যক্ত সম্পত্তি ব্যাবস্থাপনা বিষয়ক.//////////
          "অর্পিত/পরিত্যক্ত সম্পত্তি ব্যাবস্থাপনা বিষয়ক":
              "অর্পিত/পরিত্যক্ত সম্পত্তি ব্যাবস্থাপনা বিষয়ক",
          "অর্পিত সম্পত্তির লিজ নবায়ন": "অর্পিত সম্পত্তির লিজ নবায়ন",
          "অর্পিত সম্পত্তির লিজির নাম পরিবর্তনসহ লিজ নবায়ন":
              "অর্পিত সম্পত্তির লিজির নাম পরিবর্তনসহ লিজ নবায়ন",
          "পরিত্যক্ত সম্পত্তি (এপি) ইজারা প্রদান":
              "পরিত্যক্ত সম্পত্তি (এপি) ইজারা প্রদান",
          "পরিত্যক্ত সম্পত্তি (এপি) ইজারা নবায়ন":
              "পরিত্যক্ত সম্পত্তি (এপি) ইজারা নবায়ন",
          "পরিত্যক্ত সম্পত্তির (এপি) ইজারাগ্রহীতার নাম পরিবর্তন":
              "পরিত্যক্ত সম্পত্তির (এপি) ইজারাগ্রহীতার নাম পরিবর্তন",

          /////////////////////////সায়রাত মহাল বিষয়ক.///////////////////
          "সায়রাত মহাল বিষয়ক": "সায়রাত মহাল বিষয়ক",
          "হাটবাজারের চান্দিনাভিটি একসনা বন্দোবস্ত প্রদান":
              "হাটবাজারের চান্দিনাভিটি একসনা বন্দোবস্ত প্রদান",
          "হাটবাজারের চান্দিনাভিটি ব্যবহারের লাইসেন্স নবায়ন":
              "হাটবাজারের চান্দিনাভিটি ব্যবহারের লাইসেন্স নবায়ন",
          "হাটবাজারের চান্দিনাভিটি ভূমি ব্যবহারের লাইসেন্সধারীর নাম পরিবর্তনসহ নবায়ন":
              "হাটবাজারের চান্দিনাভিটি ভূমি ব্যবহারের লাইসেন্সধারীর নাম পরিবর্তনসহ নবায়ন",
          "হাটবাজার ইজারা প্রদান": "হাটবাজার ইজারা প্রদান",
          "জলমহাল ইজারা প্রদান": "জলমহাল ইজারা প্রদান",

          //////////////////////////////ভূমি বিষয়ক অন্যান্য////////////////
          "ভূমি বিষয়ক অন্যান্য": "ভূমি বিষয়ক অন্যান্য",
          "আদিবাসিদের জমি হস্তান্তরের অনুমতি প্রদান":
              "আদিবাসিদের জমি হস্তান্তরের অনুমতি প্রদান",
          "জমির অখণ্ডতার সনদের জন্য আবেদন নিষ্পত্তিকরণ":
              "জমির অখণ্ডতার সনদের জন্য আবেদন নিষ্পত্তিকরণ",
          "করাত কল স্থাপনের জন্য জমির মালিকানার প্রত্যয়নপত্র প্রদান":
              "করাত কল স্থাপনের জন্য জমির মালিকানার প্রত্যয়নপত্র প্রদান",
          "ভূমির শ্রেণি পরিবর্তনের আবেদন নিস্পত্তি":
              "ভূমির শ্রেণি পরিবর্তনের আবেদন নিস্পত্তি",
        },
      };

  static translate(var text) {
    text = text.toString();
    if (text == "0") {
      return "০";
    } else if (text == "1") {
      return "১";
    } else if (text == "2") {
      return "২";
    } else if (text == "3") {
      return "৩";
    } else if (text == "4") {
      return "৪";
    } else if (text == "5") {
      return "৫";
    } else if (text == "6") {
      return "৬";
    } else if (text == "7") {
      return "৭";
    } else if (text == "8") {
      return "৮";
    } else if (text == "9") {
      return "৯";
    }
  }
}
